In [2]:
import pandas as pd

data = {
    'Nome': ['João', 'Maria', 'Pedro', 'Ana', 'Luiz'],
    'Idade': [25, 30, 22, 28, 35],
    'Cargo': ['Analista', 'Gerente', 'Analista', 'Coordenador', 'Gerente'],
    'Salário': [3500, 5000, 3200, 4800, 5500],
    'Departamento': ['RH', 'Vendas', 'RH', 'TI', 'Vendas']
}

df = pd.DataFrame(data)
df

    Nome  Idade        Cargo  Salário Departamento
0   João     25     Analista     3500           RH
1  Maria     30      Gerente     5000       Vendas
2  Pedro     22     Analista     3200           RH
3    Ana     28  Coordenador     4800           TI
4   Luiz     35      Gerente     5500       Vendas